window.VA = window.VA || {};

VA.buildings = {
  food:        ['Ферма','Мельница','Ирригация','Житница'],
  animal:      ['Пастбище','Скотный двор','Мясная ферма'],
  industry:    ['Шахта','Карьер','Лесопилка','Кузница','Металлургический комбинат'],
  alchemy:     ['Алхимическая лаборатория','Аптека'],
  artifact:    ['Мастерская артефактов','Артефакториум'],
  crystal:     ['Кристальная мастерская','Кристальный сад'],
  engineering: ['Мастерская','Крепость'],
  logistics:   ['Склад','Дорога','Порт'],
  management:  ['Ратуша','Административное здание'],
  melee:       ['Казармы','Тренировочный лагерь'],
  range:       ['Стрельбище','Башня лучников'],
  war:         ['Штаб','Военная академия'],
  stealth:     ['Убежище','Кристалл маскировки'],
  diplomacy:   ['Дом переговоров','Посольство'],
  culture:     ['Храм','Театр'],
  medicine:    ['Лазарет','Больница','Госпиталь'],
  science:     ['Башня учёного','Библиотека','Университет'],
  sea:         ['Пристань','Порт'],
  economy:     ['Рынок','Банк'],
  intel:       ['Разведывательный пункт','Шпионская сеть']
};